layer {
  name: "data"
  type: "DummyData"
  top: "data"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 1
    }
    shape {
      dim: 2
      dim: 2
      dim: 6
      dim: 6
    }
  }
}
layer {
  name: "data_conv"
  type: "Convolution"
  bottom: "data"
  top: "data_conv"
  convolution_param {
    num_output: 2
    pad: 1
    kernel_size: 3
    stride: 1
  }
}
layer {
  name: "bbox"
  type: "DummyData"
  top: "bbox"
  dummy_data_param {
    data_filler {
      type: "constant"
      value: 0
    }
    shape {
      dim: 1
      dim: 1
      dim: 2
      dim: 8
    }
  }
}
layer {
  name: "data_crop"
  type: "CropBBox"
  bottom: "data_conv"
  bottom: "bbox"
  top: "data_crop"
}
layer {
  name: "dummy_loss"
  type: "EuclideanLoss"
  bottom: "data_conv"
  bottom: "data_crop"
  top: "dummy_loss"
}
